[
    {
        "name": "Isaac Cowen",
        "review": "Such an amazing time. Went in for my friends birthday dinner. This was the last night of communal tables before they changed up service, so felt very lucky to be there. We were greeted when we entered and lead upstairs for cocktails and appetizers. Everything was so good. Service was very attentive. Different chefs explained each dish to the diners. The head chef encouraged every to come up to the pass to chat with them. Can't wait to come back and see what's different after the remodel.",
        "star": "5 stars",
        "date": "3 months ago"
    },
    {
        "name": "Archit Jha",
        "review": "Celebrated my fiancé’s birthday here and they left no stones unturned in the food and service. Choicest of ingredients prepared with passion and served spectacularly with panache. It’s as good as fine dining gets. Besides the warmth and attentiveness of the staff, wanna call out how they go above and beyond in ensuring that it’s one of your most memorable nights dining out. An anecdote is, one of the servers noted our interest in hot sauces from my questions about the dishes, and we had an experimental hot sauce to-go from the chef with our breakfast for next day. Can’t recommend Lazy Bear enough 🐻",
        "star": "5 stars",
        "date": "a month ago"
    },
    {
        "name": "isabelle C",
        "review": "The food is here amazing start to finish. The desert is was so delightful. I loved all the food here and when I went, there were a lot of fish dish and all of them were great. It was rich in flavor but still not heavy. The staff makes you feel comfortable. The service is amazing because they are not stiff and yet make you feel very attended. The atmosphere is fun like dark cabin in the mountains like cozy and grand. I will for sure come back in the future.",
        "star": "5 stars",
        "date": "5 months ago"
    },
    {
        "name": "Nancy L",
        "review": "I was underwhelmed. Overall I enjoyed the dinner, especially the egg mousse and grit. Their chefs seemed to like to put lots of salt in everything.  I found the butter, trout soup, shrimp grill and a couple of other dishes way too salty. Not the best Michelin-starred restaurants I have been to. Not great for value.",
        "star": "4 stars",
        "date": "3 months ago"
    },
    {
        "name": "Rachel Bonifacio",
        "review": "Staff are so friendly and quirky, it's fun and casual, not a snobbish restaurant at all. The food is unforgettable — great presentation, interesting stories about the ingredients, taste chemistry was really good! I got the non alcoholic pairing and that was amazing.\n\nIt's one of the best Michelin star restaurants I've ever been to.",
        "star": "5 stars",
        "date": "5 months ago"
    },
    {
        "name": "Squirrel Friend",
        "review": "Lazy Bear is another amazing dining experience in San Francisco. The menu offers a woodsy flair with foraged ingredients. Interesting and unexpected flavors such as pine are incorporated really well into the menu. The seafood is handled expertly. It is also a great place for lamb/mutton lover as two types of really delicious lamb chops are served for main protein. Desserts are exceptional especially the blueberry course. The draw back is that couple dishes are heavily salted for my taste, for example the butter course. Wine pairing is great. I really recommend the Yquem flight for the dessert. The Yquem sommelier is very knowledgeable and fun to chat to if you love Yquem. Service is top notch. As a solo dining guest, I really appreciate that the staff keep up with my pace and did not make me sit through 2-3 hours for dinner. Overall, this was quite an unforgettable dinner for me.",
        "star": "5 stars",
        "date": "5 months ago"
    },
    {
        "name": "Michelle Gao",
        "review": "Food was delicious and average for Michelin 2 stars, dessert was amazing.  The vibe was more casual than I expected…LOVE the cold brew coffee, best I’ve ever had.",
        "star": "4 stars",
        "date": "4 months ago"
    },
    {
        "name": "Nan H",
        "review": "Amazing experience with unique flavors and taste. Everything is cooked with ingredients that are in season. Brought extra bread and butter for my teen. Both my kids were very impressed.",
        "star": "5 stars",
        "date": "4 months ago"
    },
    {
        "name": "Joseph Puopolo",
        "review": "I won’t give away the details of this amazing\n⭐️ ⭐️ Michelin Star restaurant suffice it to say the food, service and experience was exceptional.\n\nOne cannot overstate how much attention to detail the restaurant team put in to craft an unforgettable dining experience. From the moment we walked in to our departure, the care and service was exceptional.",
        "star": "5 stars",
        "date": "4 months ago"
    },
    {
        "name": "Marco Cummings",
        "review": "Truly Michelin quality food and service. The menu is very inventive but at the same time captures local flavors as well as nostalgia. The staff is highly attentive and knowledgable of all of the food and beverage offerings, which is a lot of information to process. Despite the fine dining flavors and service, the restaurant is unpretentious with an inviting and cozy atmosphere and no formal dress code. You are treated like a guest, not a customer which is the level of service that should be expected when spending Michelin prices.",
        "star": "5 stars",
        "date": "9 months ago"
    }
]