[
    {
        "name": "Sijeeta Deb",
        "star": "5 stars",
        "date": "2 months ago",
        "review": "I can't fully describe what a gem of a place this is; I highly recommend trying it. Though it's a small spot, the taste is incredible. It's definitely the best Indian food I've had in Arizona. The badam milk thandai was so delicious that I …"
    },
    {
        "name": "Manisha Deshpande",
        "star": "4 stars",
        "date": "5 months ago",
        "review": "Yummy home-like food with north Indian feels!\nBut would suggest replacing the whipped/hydrogenated fat topping with a smaller portion of actual butter, on the parantha, for a consumer-focused healthier choice."
    },
    {
        "name": "Wasiq Saeed",
        "star": "5 stars",
        "date": "2 months ago",
        "review": "If you enjoy desi vegetarian breakfast, it's a must go to place. Order Chana, Alo paratha, moli paratha , sweet Lassi. Everything had their original taste from the subcontinent, a must go to for desi Nashta. …"
    },
    {
        "name": "Sayali Marathe",
        "star": "5 stars",
        "date": "2 months ago",
        "review": "I found Aja Catering online, a stone throw away from where I live, and I wish I had found them earlier! Aja Catering are a wholesome, family-owned, and generous establishment serving home-style Indian food. I moved to the US 2 years ago and …"
    },
    {
        "name": "Akhila Yennam",
        "star": "5 stars",
        "date": "7 months ago",
        "review": "The food is top notch it’s soo flavorful and delicious. Its pretty simple menu they update the daily curry menu on the website and the standard menu can be found online too. They make fresh rotis and parathas. Each paratha is served with …"
    },
    {
        "name": "sneha khardekar",
        "star": "5 stars",
        "date": "7 months ago",
        "review": "Aja Catering exceeded all expectations. From the warm welcome to the impeccable service, every moment was exceptional. The food was exquisite, bursting with flavor and beautifully presented. I highly recommend Aja Catering for an unforgettable dining experience. Can't wait to return!"
    },
    {
        "name": "Shambhavi Rai",
        "star": "5 stars",
        "date": "4 months ago",
        "review": "Delicious food!! We ordered punjabi samosa, chhole masala, poori, matar rice and gulab jamun. Everything item tasted home like. Everything was packed nicely as it was a bulk party order. The ordering process was easy too. Just message your …"
    },
    {
        "name": "Sharvee Shrotriya",
        "star": "1 star",
        "date": "4 months ago",
        "review": "WORST EXPERIEBCE EVER!!!\nWe catered veg Manchurian and hakka noodles from them on our daughter's birthday party. Nobody liked the food. We are left with almost everything. I called them …"
    },
    {
        "name": "Vivek Sable",
        "star": "5 stars",
        "date": "10 months ago",
        "review": "Perfect authentic Punjabi food..!!😋 Total 3 Visits during our PHX stay from NJ. We tried almost all dishes.. All Paratha’s are top notch.. chole bhature, Mango Shikanji must try..!!  Panipuri , saag & Kachori’s and Gajar ka Halwa are delicious 🤤 kids enjoyed Mango Lassi 😜 …"
    },
    {
        "name": "gau'tam shiro'dkar",
        "star": "5 stars",
        "date": "a year ago",
        "review": "This has been the best dhaba style food in the US!\nWent here on a busy Saturday lunch time. The indoor seating is less but it's worth waiting. Loved their shikanji - got one for the way back. My favorite were …"
    },
    {
        "name": "Unisha Maskey",
        "star": "5 stars",
        "date": "4 months ago",
        "review": "This business is the best place in the valley to eat North Indian/Punjabi food. The owner Majinder Paji is a great man. Business is run by family. Weekends are super busy and packed. You know the food is legit good when all Desi dine in the …"
    },
    {
        "name": "Vikram K",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Best food , never had a bad experience. Hope it was close to my place in Scottsdale but worth driving and never got disappointed. No food color , not too oily or too spicy like other Indian restaurants. The taste is great authentic Punjabi style and you won’t feel guilty afterwards."
    },
    {
        "name": "Ankit Bhagat",
        "star": "5 stars",
        "date": "7 months ago",
        "review": "I used to order their weekly combos regularly for home deobut this was my first time dining in. Tried their parathas and chole bhature, both of them were really perfect, just like back at home. Would highly recommend."
    },
    {
        "name": "Ashish D",
        "star": "5 stars",
        "date": "2 months ago",
        "review": "This is one of the undiscovered gem. In Phoenix this is so far the Best food.\nDon't judge the Food quality by seeing the restaurant from outside. This is small place but very authentic taste. …"
    }
]