[
    {
        "name": "Teeny Greeny",
        "star": "5 stars",
        "date": "a week ago",
        "review": "Corey has been fantastic in managing my Google Ads! He’s always on hand to answer my questions and takes the time to explain the best options for my small e-commerce brand. His support has given me real confidence that Google Ads can be effective for my business. Highly recommend!"
    },
    {
        "name": "Angela Meggs",
        "star": "5 stars",
        "date": "5 months ago",
        "review": "It's been an absolute breath of fresh air working with Corey of Advertiser Advisors. So often I worked with Google Ads Agents feeling even more confused about the ads I ran, than when I set them up on my own. Corey has made this process much easier to understand. With his assistance I've been able to better focus my advertising dollars and see the kinds of return I never achieved with the Google Ads Agents. No more Google Ads Agents, I'm only working with Advertiser Advisors."
    },
    {
        "name": "Pat Bennett",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Corey has been great to work with for the Google Ad Words account.\nHe is very patient and listens to what have been prior issues and he looks for ways to improve the campaigns while reducing the costs.\nI'm impressed with the honesty - he is looking at ways to incorporate his ideas and updates to existing campaigns in order to maximize the benefit and get the best return.\nIt's been a great start to working together.\nThank you Corey!"
    },
    {
        "name": "Chester Whittaker",
        "star": "5 stars",
        "date": "a week ago",
        "review": "Corey setup up my website and my Google ads he has done a great job highly recommend him"
    },
    {
        "name": "Monica Kelly (MK Marketing & Designs)",
        "star": "5 stars",
        "date": "3 years ago",
        "review": "Corey is amazing, I used to try to dabble in google ads, until I met Corey. It's hard to find someone you trust to let work with your clients and you refer people to that you can trust. Corey's work is very impressive he is knows how to run successful Google campaign and ads so people see ROI, he is responsive, knowledgeable, and most importantly effective. I look forward to continuing to work with Corey on a variety of projects. IF you are looking for the best in the business you have found him!! I 100% recommend Corey!"
    },
    {
        "name": "Joshua Heizer",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Working with Corey at Advertisers Advisors has been by far the best digital agency that we have ever worked with. Very personable, professional and quick to respond to our needs. He helped us build an awesome adwords campaign that was very detailed and effective. Look no further if you want the best. Thanks Corey we appreciate all that you do!!"
    },
    {
        "name": "Patty Hamilton",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Corey is the best! Expert in his knowledge of Google Ads, clear in his communication and hard working. Triple threat. We have referred friends and all agree. Grateful to work with him."
    },
    {
        "name": "Michael Brockhouse",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Corey at Advertiser Advisors LLC is truly amazing. He get all this Google stuff. Makes it easy for me to see how things are going. We can quickly figure out the next move. He's a wealth of expertise, knowledge, and ideas. He's not only been so helpful with the Google ad campaigns, but has helped with ideas for improving our online platforms from social media to our website. I cannot recommend him enough. I love how easy it is to schedule time with him. He's always on-time and ready to go. Truly a professional that can help your business reach more people."
    },
    {
        "name": "Wenda Blankenship",
        "star": "5 stars",
        "date": "2 weeks ago",
        "review": "Attentive!  Quick response when seeking advice & moving our business forward. Weekly reports which we love!"
    },
    {
        "name": "Steve & Annette Economides",
        "star": "5 stars",
        "date": "a year ago",
        "review": "I've known Corey Gefroh for at least 5 years working together for several clients. I do SEO and Corey does the PPC. He is consistent in his deployment and management of ad campaigns. He is on time with reporting, and he's always available to answer clients questions.\n\nIn all the years I've known him, I've only seen him loose one client ... they were very difficult to work with .... and they disengaged from working with me also.\n\nThe rest of the clients that we have shared have stayed with him for at least 3 years, some even longer.\n\nYou don't stay with someone doing PPC if the ROI isn't there.\n\nI don't know the specifics of how much ROI these clients are getting, but they all are growing and sticking with Corey."
    },
    {
        "name": "Peter",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Corey is knowledgable, great as serving us as a customer, and very communicative. If you're looking for help with digital advertising to take your business or ministry to the next level, I would highly recommend Corey!"
    },
    {
        "name": "Unique Electrical",
        "star": "5 stars",
        "date": "2 years ago",
        "review": "Corey is awesome, he was referred to me and has made what he said happen, very happy and would recommend him for all your advertising needs. Corey will take the time to explain things in great detail when needed and has been exceptional in putting our needs as his own. Great job and glad we were able to connect and work together."
    },
    {
        "name": "Tracine Umber",
        "star": "5 stars",
        "date": "2 years ago",
        "review": "Corey is top notch! He knows his niche and finds the best way to make sure OUR businesses are front of mind when one goes to do a Google search. He knows how to analyze the data that will drive leads which pushes businesses to the top of the line. He is a hard worker takes each opportunity with his clients has top priority.  I can tell that our personal business success is his personal triumphs as well! Give Corey a call, you wont be disappointed!"
    },
    {
        "name": "Affordable Portables",
        "star": "5 stars",
        "date": "2 years ago",
        "review": "It's taken me awhile to write this because I've wrestled about keeping the best kept marketing secret to myself. However that just wouldn't be ethical or good karma.\nSo as a small business owner you know how everyone wants your business and tells you they can increase your ROA as well as, automate you to get you more business etc etc. After trying a few places some well known and big agencies that almost tanked my business, I was hesitant to try an outside source one more time. It had gotten to the point where outside marketing was just really good at taking your $ and you got very little in return. Do to those experiences, I decided I had to learn all the marketing myself. In the meantime I became a FB ads expert and started to pursue google. Heck Google even gives you free person to your account. Which at first was good and then they were worthless. Being a small business and busy the thought of having to learn how to excel at one more platform made me want to throw up. I hesitantly spoke to Corey. His plan was great and if he sucked I was only out 1 month and I thought it was worth the risk.\nI am here to tell you it's the best investment I've made this year. I might be intuitive but Corey is the data guy with the numbers, yet he always listens to my thoughts and together we come up with a plan that is exciting. Beyond that it absolutely works. So much that I don't worry about certain things anymore. It's really nice to have someone you can absolutely trust. Corey is the real deal. I recommend  not just taking my word for it. See for yourself do a month even if it's not fast and furious at first hang in there for 1 more month you'll thank me that you did!\nCorey Is The Google Marketing Shizit In My Book!!!\nThank you for being someone I can trust and helping me have a plan that has super return on my investment!"
    },
    {
        "name": "Rebecca Bailey",
        "star": "5 stars",
        "date": "a year ago",
        "review": "Corey is a Joy to work with; very knowledgeable and attentive to customer needs. Highly recommend Advertising Advisors!"
    }
]