[
    {
        "name": "Praveen S.",
        "star": "5 star rating",
        "date": "Oct 21, 2024",
        "review": "As I sat down, they got this papad with Chutneys! The setup got me in the mood to enjoy some chaat.\nOrdered Papadi Chaat and it was lip smacking ! The Papadi itself was freshly fried, I think. Tasty and I could feel the freshness.\nDahi bhalle was equally delicious. Best part was - curd wasn't sweet! A rarity! Enjoyed a lot.\n\nWill visit again for proper lunch / dinner food.\n\nServers were friendly and though it was taking a while for food to be served, I enjoyed the ambience of the place."
    },
    {
        "name": "Ben B.",
        "star": "5 star rating",
        "date": "Jul 23, 2024",
        "review": "Came here on a whim, and we immediately fell in love. We got there a little late but they still accommodated (We had planned on a to go order but they invited us to stay).\n\nFood: first off those little thin chips that break and you dip dip in the sauces. Amazing texture and the flavor was perfect. This was the first mango lassi that I actually liked. It was so good, I forgot I didn't like them. Then the samosas came out. They were full, packed to the rim with delicious flavor. We ordered Paneer \"naan\" with the tikka masala. We will ALWAYS come here now.\n\nService: you know that feeling of going over to grandmas house and you know you are loved, you are safe and you know you're gonna eat GOOD? Same same. We were treated so well and even though it was close to closing time we only felt appreciation from them for us coming in. Drinks were always full, Nick was so welcoming and really made it a great experience.\n\nAmbiance: from the outside it feels like an adventure. The second you open the door and get a whiff of what's been cooking you know you made a good decision. The waiting area was comfortable and had a good aesthetic for the restaurant. The plate ware, cups and silverware were unique and fit the restaurant vibe perfectly.\n\nAre we going back? Absolutely!\nShould you go? 100%"
    },
    {
        "name": "Stephanie K.",
        "star": "5 star rating",
        "date": "Jul 6, 2024",
        "review": "We love The Dhaba, so much so that we drive from Surprise. The food is outstanding.\nI also want to say the family who owns it is also wonderful. They work so hard to run the restaurant, the children work full time and go to college. We have NEVER had anyone be disrespectful in anyway.\nThe restaurant is quiet and clean. They even have a larger dinning area for lager groups. We will continue to drive across the valley to eat here and support a hardworking family."
    },
    {
        "name": "Melissa F.",
        "star": "4 star rating",
        "date": "Jun 3, 2024",
        "review": "This place is very cute inside, has great service, and solid Indian food. Love the metal plates and cups! They provide plenty of rice and large portions, and the garlic naan is fantastic. We ordered three meals between the two of us, and both had lunch for two days afterward! Good option for Indian in Tempe!"
    },
    {
        "name": "Nicole B.",
        "star": "5 star rating",
        "date": "May 2, 2024",
        "review": "This food is amazing. The service, the atmosphere. It's worth it, if you can try it. The food is really spicy though so do not be cocky and try to get a 10 on the scale, start low if you are not used to Southern Asian spice."
    },
    {
        "name": "Rachel K.",
        "star": "5 star rating",
        "date": "May 16, 2024",
        "review": "I had to update my review from forever ago to remind everybody that this is STILL 5 stars and STILL one of the best restaurants in AZ hands down. Phenomenal, attentive service every time I come here. Again, Karan is super nice and so is Enu. And all of the staff!! Everyone is always making sure our cups are constantly filled and we are constantly happy. We are treated like family here and taken in no matter how busy it seems (and of course it is always busy - because it is an AMAZING PLACE!). This place honestly has my business for life and it should have yours! I say this without an ounce of bias in my body. The Dhaba is a regular date night spot for me and bae at this point because not only is the food simply amazing, but so are the people. Yelp friends, PLEASE check out this spot if you haven't already!! ASAP!"
    },
    {
        "name": "Marti P.",
        "star": "5 star rating",
        "date": "Mar 16, 2024",
        "review": "Always a great experience here. Outstanding service and magical flavors! We came for lunch which is the same menu as dinner, so we stuck mostly to appetizers. We were celebrating a birthday and they brought us a lovely frozen mango treat, delicious!"
    },
    {
        "name": "Josh G.",
        "star": "5 star rating",
        "date": "May 2, 2024",
        "review": "The Dhaba is my favorite Indian restaurant in the Valley. It is consistently very tasty. I like the Garlic Naan and Paneer Tikka Masala the most.\n\nThe staff frequently check to see if you need more water and are friendly.\nThere usually will be a wait of about 10-15 minutes. Parking is usually pretty easy.\n\nThe only downside I would say is that it that the food is on the pricier side. Overall though, this is a great spot to get some Indian food and there plenty of vegetarian options as well."
    },
    {
        "name": "Reema M.",
        "star": "4 star rating",
        "date": "Dec 27, 2023",
        "review": "I recently dined at the Dhaba restaurant, and while the service was professional, it didn't stand out. The rustic interiors and limited bathroom options might not appeal to everyone. On the bright side, there's a commendable variety of vegetarian dishes.\nThe Sweet Lassi deserves a 5/5 for its delicious, hearty flavor.\nThe Vegetarian Platter, though diverse, felt a bit heavy and soggy, earning it a 3/5.\nPani Puri (4/5) was enjoyable, but more potatoes would enhance the experience.\nThe Malai Kofta (5/5) and Paneer Kadhai (4/5) impressed, but Dal Makhani (3/5) fell short of high expectations.\nThe Vegetable Biryani to go (4/5) was flavorful but heavy. Despite some quirks, it's a must-visit for good food, though the Yelp app's Togo go discount wasn't honored FYI for Yelpers!"
    },
    {
        "name": "Aaliyah F.",
        "star": "5 star rating",
        "date": "Jul 7, 2024",
        "review": "This is my fiancé's and I's favorite place for Indian food. The samosa chaat and chicken tikka masala are my favorites here, but everything is just as delicious! The service was incredible and you just know that the food is always made with love. The owner also let us try their mango ice cream which was fantastic! I look forward to dining again."
    },
    {
        "name": "Avinaba C.",
        "star": "3 star rating",
        "date": "Dec 22, 2023",
        "review": "I've been coming here for years and it has always been hit or miss. Sometimes the food is really good but other times not as much. Recently it's been more miss than anything. It feels like we're having mainly oil/butter with a small portion of chicken/lamb/etc and frankly the price is not worth it. It was also difficult for me to tell the difference between the garlic and plain naan which shouldn't be difficult to tell apart.\n\nAlso would highly recommend that you come in person and eat rather than DoorDashing.\n\nTheir service has always been great so no complaints there and the ambiance is decent. It's a typical Indian restaurant and it's cool that they have the traditional utensils and plates.\n\nWill be back again though and hoping to have some better quality food."
    },
    {
        "name": "Cameron M.",
        "star": "5 star rating",
        "date": "Oct 7, 2024",
        "review": "Amazing. The best. Great food, very affordable, friendly service. Have been twice and both visits were exceptional"
    },
    {
        "name": "Depeka S.",
        "star": "3 star rating",
        "date": "Aug 2, 2023",
        "review": "Visited the restaurant on a Saturday afternoon as we were in the mood to indulge in some Indian delicacies. Once the entire group was present we were promptly seated.\nThe ambiance is very homey and warm and as it's a family owned restaurant it gives the warm vibes. The restaurant was fairly crowded.\nWe all ordered lassi ranging from mango, rose , sweet to salted! All of them tasted fabulous but only drawback is that the sweetness in lassi cannot be altered I would love that option!\nFor the main course nothing stood out everything was edible but I was extremely disappointed with the recommendation I went ahead with - the paneer hariyali tikka. The name itself suggests green but there was nothing green about it not the flavor nor color. Back home this is a favorite and this didn't match up. We were treated with hot jalebis at the end.\nI would also like to mention that although the place appears clean I saw 2 roaches on the wall at our table which instantly killed my appetite. I wanted to bring it to the restaurants notice but they were busy attending other customers."
    },
    {
        "name": "Harpreet S.",
        "star": "5 star rating",
        "date": "Aug 24, 2023",
        "review": "Came in for an early dinner and they had a few tables already seated. The location is near the light rail and ASU which was convenient for us while in Tempe. We ordered a couple of cocktails which were amazing. The staff was very friendly and checked in frequently. We ordered some delicious tandoori shrimp, butter chicken, garlic naan, matar paneer, and rice. Everything was mouth watering to the point they almost had to roll me out of here. You should def check out this spot."
    }
]