[
    {
        "name": "Brandon W.",
        "star": "5 star rating",
        "date": "Aug 15, 2024",
        "review": "If you're a fan of open, flame-grilled burgers, The Chuck Box is a must-visit. This cozy spot may be small, but it packs a big punch when it comes to delivering some of the best burgers in town. The moment you walk in, you're greeted by the sizzling sound of burgers cooking fresh off the grill, and the aroma is nothing short of mouth-watering.\n\nOne of the features at The Chuckbox is their condiment bar. It's a burger lover's dream, allowing you to customize your burger to your exact liking.\nThe onion rings are #fire--double-fried to perfection, resulting in an irresistibly crispy texture that pairs wonderfully with the juicy burgers.\n\nThe staff here are genuinely friendly and add to the welcoming atmosphere. Despite the small space, they manage to keep things moving smoothly, even during the busy lunch and dinner hours. However, because of the limited seating, be prepared to sit outside if the place gets crowded. For two people, you can expect to spend around $20-$30, which is a great deal considering the quality of the food and the overall experience.\n\nPS - place is cash only!! Although, there is an ATM on site if needed."
    },
    {
        "name": "Shiona B.",
        "star": "2 star rating",
        "date": "Oct 24, 2024",
        "review": "The food was quite expensive for three persons. We ordered three burgers and two sides and a 16oz beer and large drink.\nI dislike the items being sold separately like the fries, onion rings, and burgers and drink. On top of that tax was $3. I wish they could get there prices right when paying. I didn't appreciate the up charge price on two of the big burgers. They took two extra dollars from me when the menu states the burger to be $8.35 each but I charged more.\nThe man at the till with the mustache and deep voice talked reluctantly rude but tried to make it seem okay but it wasn't.\nOther than that it's a nice place to watch food be made in front of you. And wait in line to receive order.\nThere is a food bar for burger toppings and condiments.\nThe place is very nice and calm. Not loud. No music. Just smell like burgers."
    },
    {
        "name": "Lenore B.",
        "star": "4 star rating",
        "date": "Aug 9, 2024",
        "review": "Get ready for an experience! The Chuck Box has been around since 1972 and they cook over an open mesquite fire. Warning, this place is cash only! They do have an ATM available inside the restaurant, but it's better to come prepared with cash in hand.\n\nThere is limited seating inside, but honestly, it's part of the charm of this place. When temperatures are more agreeable, there are some tables to sit at outside of the restaurant. It is very rustic inside, and you stand in line and order at the counter. It reminds me a lot of the Seinfeld episode The Soup Nazi. Don't worry, the line moves pretty fast.\n\nOf course they serve up fantastic tasting burgers and recently I decided to go for the hot and spicy chicken breast sandwich. It was phenomenal. There is a condiments bar so you are able to dress your burger or chicken sandwich however you would like.\n\nIf you're visiting Arizona State University or Tempe Arizona for the first time, you definitely should check this place out."
    },
    {
        "name": "Steven B.",
        "star": "5 star rating",
        "date": "Nov 5, 2024",
        "review": "Got the Tijuana torpedo and onion rings. Burger was juice and onion rings were crispy. Burger is cooked in front of you as you wait.\nGreat experience!"
    },
    {
        "name": "Kimberly H.",
        "star": "5 star rating",
        "date": "Jul 7, 2024",
        "review": "Love these delicious burgers! Have tried several times to eat here but there was always a line! Finally got a chance to experience these BIG burgers and surprisingly the line moves fast!\nDefinitely got stuck in the smoke from the grill after I ordered...just do what I did and stand super close to the person in front of you and strike up a conversation!\nI got the great Big 1/2 pounder with some of the onion rings and I'm not afraid to say it, but I finished every bite! I don't want to leave anything behind! I love being able to put my own toppings on as well! Looking forward to my next visit!"
    },
    {
        "name": "Susan H.",
        "star": "2 star rating",
        "date": "Jun 9, 2024",
        "review": "I came across a list of the best burgers in each state. For Arizona, The Chuck Box was listed as the state's best. Before we went to AZ, I asked our son-in-law if he had ever been there. After all, it's been in business for 40 years. Even though he grew up in the area, he had never heard of it. When I mentioned seeing it on the best burger list, he was interested in trying it.\n\nFirst of all, I want to mention that it is cash only. They do have an ATM on site if you need cash.\n\nWe were all eager to try the burgers. Ordering works this way --- upon entering, you get in a cafeteria-like line. Then you give your order to the person making the food. They cook their burgers on a grill where mesquite is used. Yes, it all smelled good.\n\nWe all gave our orders. Once you do that, you can't advance in the line until your burger gets handed to you. While we were waiting, a woman who was ahead of us in line with her family, started waxing poetic about the burgers saying they were the best they've ever had. Plus, she talked about how clean they kept the kitchen area (we concurred with that). She also mentioned how nice the staff was and one person had been working there for 40 years (Yes, the staff was nice).\n\nThings get somewhat complicated once you get your burger. If you order a side like onion rings or fries, no one tells you to just grab a serving as you move along the line. Thus, my husband didn't grab his onion rings but was charged for them. Drinks are self serve.\n\nHow were the burgers? Sorry to say but they weren't that good. They are thin and we all commented how they were dried out with little flavor. That said, the onion rings (which I shared with my husband) were actually quite good. The batter clung to then quite well and they were crunchy with good flavor.\n\nThe dining area is rustic --- wooden tables and (if I recall correctly) stools. We felt a bit cramped.\n\nIn the end, we spent over $80 to feed 6 of us. Trust me...there are better burgers in AZ."
    },
    {
        "name": "Bailey L.",
        "star": "4 star rating",
        "date": "Feb 21, 2024",
        "review": "Honestly, I cannot believe it took me 10 years to check The Chuck Box off my AZ food card. I even use to work RIGHT next door, constantly smelling the greasy deliciousness. It seems like a right of passage in Tempe - located right in between Campus and basically DT Tempe this little hole in the wall is a great spot.\n\nIt's very rustic, wooden shack type vibes. The outdoor patio sports log stumps as seats, not the most comfortable, but fit the bill! The inside had seating and it's counter style, made to order. The menu is straightforward featuring various size of burgers and a few specialty ones, with a large self serve topping area, featuring all the classics. This is no gourmet burger shop, this is picnic, classic, served on paper plates food. They have tasty fries and other fried sides such as jalapeno poppers - DELISH - onion rings and also have chicken tenders for those who are not burger people. They have a couple basic beers, by the bottle and pitcher and all the prices are about as cheap as you could get today! 1/2 Burger is about 8 dollars with small upcharge for cheese.\n\nthis place is BOPPING, in no way did I ever expect such a crowd. The line was long and the place does get packed, but it moved relatively speedy and you get your burgers before you pay and sit down.\n\nThe parking lot is also pretty tight and packed, so something to expect. They also have two small restrooms. it's a great spot for a group or quickish bite!"
    },
    {
        "name": "Michelle A.",
        "star": "5 star rating",
        "date": "Feb 25, 2024",
        "review": "Flew in from Vegas for Innings fest 2024 and had The Chuck Box bookmarked on Yelp as a place to check out.\nI was staying nearby and my Hotel had a full kitchen and provided breakfast daily, so I almost did not have a reason to go to Chuck Box, other than me being an omnivore, luckily one day before the festival I stopped in to Starbucks for a coffee and as I exited I noticed an older looking wooden house and saw the name Chuck Box on the exterior.\n\nExcited, I checked my pockets and had cash on hand, rare occurrence for me these days, so I took that as a sign and went in, as you enter you see a table full of condiments (reminded me of a salad bar) from, mayo, jalapeños, pickles, ketchup, etc, just about anything you can think of adding to a burger.\n\nThe interior itself is fairly small, maybe 10-12 tables from my quick glance around the restaurant, but there is also seating outside.\nThe line can get quite long but I can see why, the burgers and food are cooked to order over a charcoal flame, the food was on point as well as the price, check it out and bring cash!"
    },
    {
        "name": "Jessica I.",
        "star": "2 star rating",
        "date": "Sep 18, 2024",
        "review": "Eh. It was on a couple travel guides, I think because how long it's been around, but truthfully it was just ok. The patty was thin and onion rings were not memorable. There's a ton of other places to eat on this street alone - would recommend going elsewhere."
    },
    {
        "name": "Rigo V.",
        "star": "5 star rating",
        "date": "Jan 6, 2024",
        "review": "The Chuck Box\n6455 E Southern Ave Mesa, AZ\nJanuary 05, 2024\n\nFood: 5/5\nService: 5/5\nPortion size: 5/5\n\nVisit description: Dine-in order, Came to Chuck Box one of our valley favorites for a great burger.\n\nFood: We got 2 little one's and 2 orders of fried zucchini with drinks.\n\nService: Customer service was great especially for how busy it was atleast 15 people in line when we showed up, food was ready in less than 20 minutes and the food quality was top tier, very fresh food along with condiments bar. All the food is prepared to order nothing is ready that's was a plus."
    }
]